Importing important libraries

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Reading the data

In [5]:
df= pd.read_csv('titanic.csv')

Understanding the data:
#Shape
#Five rows
#Describe

In [6]:
df.shape

(891, 12)

There are 891 rows and 12 columns in the titanic dataset.

In [7]:
#Five rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Those passengers with a 1 survived and those with a 0 under the 'Survived' column died.
The Pclass or passenger class is important because it may indicate survival rate based on class privilleges.
The name of the person  (under Name column) may not provide much information about survival chances but if the name is English, they may have had privilleges during the titanic ages.
The column on sex is categorica data and a string and I may need to convert male and female labels to numeric values. 
The Age column is important as the data is numeric and may be linked to survival chances. 
The SibSp column shows passengers who travelled with their siblings or with their spouses.
The Ticket column does not seem important however, the fare they paid is important because it may indicate their class and therefore linked to their survival.
The Cabin column has null or NAN values and these need to be dealt with in the analysis. 
The Embarked column shiws the city the passengers embarked from.

In [8]:
#Describe
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200